[
    {
        "id": 1,
        "question": "what is cors?",
        "ans": "Cross-origin resource sharing (CORS) is a browser mechanism which enables controlled access to resources located outside of a given domain.  CORS is a protocol and security standard for browsers that helps to maintain the integrity of a website and secure it from unauthorized access.It enables JavaScripts running in browsers to connect to APIs and other web resources like fonts, and stylesheets from multiple different providers."
    },
    {
        "id": 2,
        "question": "Why are you using firebase? What other options do you have to implement authentication?",
        "ans": "The Firebase Realtime Database is a cloud-hosted database. Data is stored as JSON and synchronized in realtime to every connected client. When you build cross-platform apps with our Apple platforms, Android, and JavaScript SDKs, all of your clients share one Realtime Database instance and automatically receive updates with the newest data.Usually, authentication by a server entails the use of a user question and password. Other ways to authenticate can be through cards, retina scans, voice recognition, and fingerprints."
    },
    {
        "id": 3,
        "question": "How does the private route work?",
        "ans": "The private route component is similar to the public route, the only change is that redirect URL and authenticate condition. If the user is not authenticated he will be redirected to the login page and the user can only access the authenticated routes If he is authenticated (Logged in)"
    },
    {
        "id": 4,
        "question": "What is Node? How does Node work?",
        "ans": "JavaScript is one of the most popular programming languages in the world. It powers millions of websites today, and it has attracted droves of developers and designers to build features for the web. If you’re new to programming, JavaScript is easily one of the best programming languages to get under your belt. For its first 20 years, JavaScript was used mainly for client-side scripting. Since JavaScript could be used only within the <script> tag, developers had to work in multiple languages and frameworks between the front-end and back-end components. Later came Node.js, which is a run-time environment that includes everything required to execute a program written in JavaScript.Node.js is a single-threaded, open-source, cross-platform runtime environment for building fast and scalable server-side and networking applications. It runs on the V8 JavaScript runtime engine, and it uses event-driven, non-blocking I/O architecture, which makes it efficient and suitable for real-time applications."
    }
]